app/controllers/files_controller.rb

  def index
    @images = Image.all
    @videos = Video.all
---
SELECT "images".* FROM "images"
SELECT "videos".* FROM "videos"