app/controllers/uploads_controller.rb

INSERT INTO "images" ("created_at", "file", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 20 Sep 2013 10:49:40 UTC +00:00], ["file", "arrow-buttons.png"], ["name", "kjshdfkjsdhf"], ["updated_at", Fri, 20 Sep 2013 10:49:40 UTC +00:00]]
INSERT INTO "videos" ("created_at", "file", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 20 Sep 2013 12:40:19 UTC +00:00], ["file", "Arrow_-_Copy.flv"], ["name", "video11"], ["updated_at", Fri, 20 Sep 2013 12:40:19 UTC +00:00]]
---
  def create
    @image = Image.new(params[:image])
    @video = Video.new(params[:video])
    if @image.name != nil
      if !(@image.save)
        redirect_to files_path, :notice => "Invalid file format."
        return
      end
    else
      if !(@video.save)